<?php
/**
 * Created by Ariful Islam.
 * Organization : Pigeon Soft
 * Date: 11/07/2020
 * Time: 1:14 AM
 */


namespace App\Helpers;


class StaticData
{
    public static function get_district()
    {
        $districts = array(
            'কুমিল্লা'=>'কুমিল্লা',
            'ঠাকুরগাঁও'=>'ঠাকুরগাঁও',
            'দিনাজপুর '=>'দিনাজপুর ',
            'রংপুর'=>'রংপুর ',
            'ঢাকা'=>'ঢাকা',
            'কুড়িগ্রাম'=>'কুড়িগ্রাম',
            'লালমনিরহাট'=>'লালমনিরহাট',
            'নীলফামারী'=>'নীলফামারী ',
            'গাইবান্ধা'=>'গাইবান্ধা',
            'চট্টগ্রাম'=>'চট্টগ্রাম',
            'রাজশাহী'=>'রাজশাহী ',
            'সিলেট'=>' সিলেট ',
            'যশোর'=>'যশোর',
            'ময়মনসিংহ'=>'ময়মনসিংহ',
            'পঞ্চগড়'=>'পঞ্চগড়',
            'বরিশাল'=>'বরিশাল',
            'ফরিদপুর'=>'ফরিদপুর ',
            'বগুড়া'=>'বগুড়া ',
            'পাবনা'=>'পাবনা ',
            'রাঙ্গামাটি'=>'রাঙ্গামাটি ',
            'কুষ্টিয়া'=>'কুষ্টিয়া ',
            'নোয়াখালী'=>'নোয়াখালী ',
            'খুলনা'=>'খুলনা',
            'টাঙ্গাইল'=>'টাঙ্গাইল ',
            'ভোলা'=>'ভোলা ',
            'বান্দরবান'=>'বান্দরবান ',
            'চাঁদপুর'=>'চাঁদপুর ',
            'হবিগঞ্জ'=>'হবিগঞ্জ ',
            'লক্ষীপুর'=>'লক্ষীপুর',
            'বরগুনা'=>'বরগুনা ',
            'ঝালকাঠি'=>'ঝালকাঠি ',
            'পিরোজপুর'=>'পিরোজপুর ',
            'পটুয়াখালী'=>'পটুয়াখালী ',
            'ঝিনাইদহ'=>'ঝিনাইদহ',
            'নড়াইল'=>'নড়াইল ',
            'মাগুরা'=>'মাগুরা ',
            'সাতক্ষিরা'=>'সাতক্ষিরা',
            'বাগেরহাট'=>'বাগেরহাট ',
            'চুয়াডাঙ্গা'=>'চুয়াডাঙ্গা ',
            'মেহেরপুর'=>'মেহেরপুর ',
            'সিরাজগঞ্জ'=>'সিরাজগঞ্জ ',
            'জয়পুরহাট'=>'জয়পুরহাট ',
            'নাটোর'=>'নাটোর',
            'নওগাঁ'=>'নওগাঁ ',
            'চাঁপাইনবাবগঞ্জ'=>'চাঁপাইনবাবগঞ্জ',
            'খাগড়াছড়ি'=>'খাগড়াছড়ি ',
            'ফেনী'=>'ফেনী ',
            'ব্রাহ্মণবাড়ীয়া'=>'ব্রাহ্মণবাড়ীয়া ',
            'সুনামগঞ্জ'=>'সুনামগঞ্জ',
            'কক্সবাজার'=>'কক্সবাজার ',
            'মৌলভীবাজার'=>'মৌলভীবাজার ',
            'গোপালগঞ্জ'=>'গোপালগঞ্জ ',
            'শরীয়তপুর'=>'শরীয়তপুর ',
            'মাদারীপুর'=>'মাদারীপুর ',
            'রাজবাড়ী'=>'রাজবাড়ী ',
            'গাজীপুর'=>'গাজীপুর ',
            'কিশোরগঞ্জ'=>'কিশোরগঞ্জ',
            'জামালপুর'=>'জামালপুর ',
            'শেরপুর'=>'শেরপুর ',
            'নেত্রকোনা'=>'নেত্রকোনা',
            'মুন্সীগঞ্জ'=>'মুন্সীগঞ্জ ',
            'নরসিংদী'=>'নরসিংদী ',
            'নারায়ণগঞ্জ'=>'নারায়ণগঞ্জ',
            'মানিকগঞ্জ'=>'মানিকগঞ্জ ',
            'অন্যান্য'=>'অন্যান্য'
        );
        return $districts;

    }

    public static function get_blood_group()
    {
        return array(
            'A+' => 'A+',
            'A-' => 'A-',
            'B+' => 'B+',
            'B-' => 'B-',
            'O+' => 'O+',
            'O-' => 'O-',
            'AB+' => 'AB+',
            'AB-' => 'AB-',
        );

    }

}
